/**
 * ==============================
 * 01 console.log() （コンソールに表示する）
 * ==============================
 */

console.log('こんそーるに表示されました'); //文字列を表示する
console.log("ダブルクォーテーションです"); // 上はシングルクォーテーション

// console.log('I'am a superman') // できないので注意
console.log("I'am a superman"); // これでOK

console.log(123456); // 数値
console.log(123 + 123); // 計算可能

/* 演算子 */
console.log(456 - 123); // 引き算
console.log(100 * 100); // 掛け算
console.log(1000 / 100); // 割り算
console.log(2 ** 10); // 累乗

1 + 5 * 8; // これはなにが起こっているのか？

console.log("これは" + "文字列の" + "結合"); // 足し算ではなく文字列の結合
console.log(123 + "文字列"); // 足し算ではなく文字列の結合


/* コメントアウトのショートカットキー */
// `⌘ + /`でその行をコメントアウト

/* 実践 */
console.log('おはよう\nこんにちは\n\nこんばんは');
